function func() {
    
    const name = prompt("გთხოვთ, შეიყვანოთ თქვენი სახელი:");
    const age = prompt("გთხოვთ, შეიყვანოთ თქვენი ასაკი:");
    const distance = prompt("გთხოვთ, შეიყვანოთ სამუშაო ადგილამდე მანძილი (კმ-ში):");
    const workDays = prompt("გთხოვთ, შეიყვანოთ სამუშაო დღეების რაოდენობა კვირაში (0-დან 7-მდე):");

    if (age < 16) {
        console.log("გთხოვთ, მოითხოვოთ გამგზავრების ნებართვა უფროსისგან.");
    } else if (age >= 16 && age < 65) {
        

        if (distance >= 0 && distance <= 5) {
            console.log("რეკომენდირებული ტრანსპორტი არის ველოსიპედი.");
        } else if (distance > 5 && distance <= 20) {
            console.log("რეკომენდირებული ტრანსპორტი არის მანქანა.");
        } else {
            console.log("რეკომენდირებული ტრანსპორტი არის მატარებელი.");
        }

        if (workDays >= 5) {
            console.log("გთხოვთ, შეამოწმოთ ტრანსპორტზე შეღავათების მიღება.");
        }
    } else {
        console.log("თქვენი ასაკი არის 65 ან მეტი. გთხოვთ, გაითვალისწინოთ სპეციალური საჭიროებები.");
    }
}


func();