'''9: კომენტარის გამოყენებით ახსენით თუ როგორ მუშაობს შემდეგი კუთვნილებები: color, background-color, font-size, font-weight, text-align'''





#color კუთვნილება განსაზღვრავს ტექსტის ფერს.
# სტილის გაწვდვა ხდება ტექსტის ფერის მითითებით, როგორიცაა ფერის სახელები 

#background-color კუთვნილება განსაზღვრავს ელემენტის ფონური ფერის.


#სტილის გაწვდვა დება ფონური ფერის მითითებით, როგორიცაა ფერის სახელები, 

#font-size კუთვნილება განსაზღვრავს ტექსტის ზომას.


#სტილის გაწვდვა ხდება ზომის მითითებით პიქსელებში (px), ემებში (em), ფუნდამენტალური ერთეულების (rem), პროცენტებში (%)
#  და სხვა ზომის
#  ერთეულებში.

#font-weight კუთვნილება განსაზღვრავს ტექსტის სიმძიმეს (ბოლომდაბალი ან სქელი).


#სტილის გაწვდვა ხდება სიმძიმის მნიშვნელობით, როგორიცაა normal, bold, ან კონკრეტული სიმძიმის ნომრით

#text-align კუთვნილება განსაზღვრავს ტექსტის მორგებას ელემენტის შიგნით.


#სტილის გაწვდვა ხდება ტექსტის ანალოგიური პარამეტრების გამოყენებით, 
#როგორიცაა left (მარცხენა გაწვდვა), right
#(მარჯვენა გაწვდვა), center (ცენტრალიზაცია) და justify (სრული გაწვდვა).

