'''3) ახსენით რა განსხვავებაა inline, internal და external css-ის კოდის წერის ტექნიკებს შორის. დაწერეთ თითოეულის 
დადებითი მხარეც. შეგიძლიათ ონლაინ რესურსების გამოყენებაც.'''

#CSS-ის სხვადასხვა ტიპის გამოყენების ტექნიკების (inline, internal, external) არსი 
# იმაშია, როგორ და სად უნდა მოათავსოთ სტილის წესები თქვენი
#  HTML დოკუმენტში. თითოეული მეთოდის თავის სპეციფიური დადებითი მხარეები აქვს
# inline CSS ნიშნავს, რომ სტილის 
# წესები პირდაპირ უნდა ჩაიწეროს HTML ელემენტში style ატრიბუტის მეშვეობით.


#Internal CSS ნიშნავს, რომ სტილის წესები ჩაიწეროს HTML დოკუმენტის <head> სექციაში <style> ტეგის მეშვეობით.

#External CSS ნიშნავს, რომ სტილის წესები განთავსებულია ცალკე .css ფაილში და HTML დოკუმენტში ჩართულია <link> ტეგის მეშვეობით.


