'''8) კომენტარების გამოყენებით ახსენით რა არის კუთვნილება, მნიშვნელობა და css-ის დეკლარაცია'''

#CSS-ის გამოყენება და სტრუქტურა მოიცავს რამდენიმე ძირითადი კონცეფციას: 
# კუთვნილება (property), მნიშვნელობა (value) და დეკლარაცია (declaration). ამ კომპონენტების 
# გაგება აუცილებელია ეფექტური და ორგანიზებული CSS-ის კოდის წერისთვის.

#CSS-ის კუთვნილება განსაზღვრავს, რას უნდა აკეთოს კონკრეტული სტილის წესი. კუთვნილება წარმოადგენს ის
#  სახის ატრიბუტს, რომელიც გაწვდავს ელემენტზე ვიზუალურ ან პოზიციონალურ ცვლილებებს.



#CSS-ის მნიშვნელობა განსაზღვრავს კონკრეტულ კუთვნილებასთან დაკავშირებულ კონკრეტულ პარამეტრს ან შედეგს. 
# მნიშვნელობა მიუთითებს, როგორ უნდა გამოიყურებოდეს ან როგორ უნდა იქცეოდეს ელემენტი.


#CSS-ის დეკლარაცია წარმოადგენს კუთვნილების და მისი მნიშვნელობის კომბინაციას, რომელიც 
# განსაზღვრავს სტილის წესებს. თითოეული დეკლარაცია შედგება 
# კუთვნილების სახელისა და მნიშვნელობისგან, რომლებიც გაწვდულია property: value; ფორმატში.


#უთვნილება გვიჩვენებს, რა კონკრეტული ელემენტური ელემენტი უნდა იქნეს გაწვდილი. მაგალითად, 
# color, font-size, margin, padding, background-color, და ა.შ.



#უთვნილება გვიჩვენებს, რა კონკრეტული ელემენტური ელემენტი 
# უნდა იქნეს გაწვდილი. მაგალითად,
#  color, font-size, margin, padding, background-color, და ა.შ.

#დეკლარაცია ერთობლივად აერთიანებს კუთვნილებასა და მნიშვნელობას,
#  რომ შექმნას კონკრეტული სტილის წესი. დეკლარაცია ყოველთვის
#  უნდა იყოს გაწვდილი {} ბლოკში და 
# თითოეულ დეკლარაციას უნდა ჰქონდეს შესაბამისი კუთვნილება
#  და მნიშვნელობა, რომლებიც ცალ-ცალკე გაწვდილი არიან 
# property: value; ფორმატში.
