// # 4. Conditional Statements(If / else)

//  # შექმენით პროგრამა, რომელიც მიიღებს მომხმარებლის ინფორმაციას (ასაკი, სქესი და შემოსავალი) და თითოეულის მიხედვით გააკეთებს პირად ფინანსურ დაგეგმვას. შემდეგი ლოგიკით:

// 1.  თუ მომხმარებელი 18 წლის ან უფროსია:

//  - თუ მომხმარებელი ქალია:

//     - თუ შემოსავალი 5000 ლარზე მეტია:

//       - დაბეჭდოს - 'თქვენი ფინანსური მგომარეობა უზრუნველყოფილია'


//  -  თუ შემოსავალი 5000 ლარზე ნაკლებია და 3000 ლარზე მეტია:

//      - დაბეჭდავ "ფინანსური პოზიცია სტაბილურია. უკეთესი გეგმაა საჭირო."

//  -  თუ შემოსავალი 3000 ლარზე ნაკლებია:

//      - დაბეჭდოს - 'გჭირდებათ ფინანსური გეგმის გაუმჯობესება'

// 2. თუ მომხმარებელი კაცია:

//      - თუ შემოსავალი 6000 ლარზე მეტია:

//         - დაბეჭდოს - "თქვენ მზად ხართ ინვესტიციებისთვის!"

//  - თუ შემოსავალი 6000 ლარზე ნაკლებია და 4000 ლარზე მეტია:

//     - დავეჭდოს "შემოსავალი სტაბილურია"



//  - თუ შემოსავალი 4000 ლარზე ნაკლებია:

//     - დაბეჭდოს -  "გჭირდებათ ფინანსური გეგმის გაუმჯობესება"

// 3. თუ მომხმარებელი 18 წლის ქვემოთ არის:

//  - დაბეჭდოს "მიიღეთ განათლება და შემდეგ დაიწყეთ ინვესტიცია"


 