// Ternary Operator
// შექმენით პროგრამა, რომელიც მიიღებს მომხმარებლის ასაკს და გამოცდის შეფასებას (0-დან 100-მდე). გამოიყენეთ ეს კრიტერიუმები:
// თუ მომხმარებელი 18 წლის ან მეტი არის და მისი შეფასება 50-ზე მეტია:

     
// დაბეჭდეთ „თქვენ წარმატებული ხართ“

// თუ მომხმარებელი 18 წლის ან მეტი არის და შეფასება 50 - ზე ნაკლებია :

    
// დაბეჭდეთ -  „გჭირდებათ მეტი სწავლა“

// თუ მომხმარებელი 18 წლის ქვემოთაა:

    
// დაბეჭდეთ -  „შენც ბავშვი ხარ, მაგრამ შეგიძლია წარმატებას მიაღწიო“



function evaluateUser(age, score) {
    const message = age >= 18 
        ? (score > 50 ? 'თქვენ წარმატებული ხართ' : 'გჭირდებათ მეტი სწავლა') : 'შენც ბავშვი ხარ, მაგრამ შეგიძლია წარმატებას მიაღწიო';
    
    console.log(message);
}

evaluateUser(20, 40); 
