// ობიექტის გასაღებების სიის შექმნა:
// შექმენით ობიექტი, რომელშიც მოცემულია წიგნების სახელები და ავტორები.
// გამოიყენეთ for...in მარყუჟი და შექმენით მასივი, რომელიც შეიცავს მხოლოდ წიგნების სახელებს.

// სტრიქონის სიმბოლოების გამოტანა:
// შექმენით სტრიქონი.
// გამოიყენეთ for...of მარყუჟი სტრიქონის თითოეული სიმბოლოს კონსოლში გამოსატანად.
// [12:57 PM]
// მასივის ელემენტების ფილტრაცია:
// შექმენით სტრიქონების მასივი.
// გამოიყენეთ for...of მარყუჟი მხოლოდ იმ სტრიქონების გამოსატანად, რომელთა სიგრძე 5-ზე მეტია.
// [12:57 PM]
// მასივის ელემენტების გარდაქმნა:
// მასივის ელემენტების ჯამი:
// შექმენით რიცხვების მასივი.
// გამოიყენეთ for...of მარყუჟი მასივის ყველა ელემენტის ჯამის გამოსათვლელად.