// შექმენით მასივი, სახელწოდებით 'allValue' და გადაეცით შემდეგი მონაცემთა ტიპები: 1. integer   2. string   3. float  
//  4. boolean   5. object, გადაცემულ ობიექტში უნდა იყვეს შეტანილი ინფორმაცია, 1. სახელი   2. გვარი   3. ასაკი   4. ქვეყანა    5. ქალაქი.
// შემდეგ უნდა ააწყოთ წინადადება თქვენს თავზე, 'ჩემი სახელია ... ჩემი გვარია ... ' და ა..შ  ----   (მასივში ჩაშენებული ობიექტიდან
// 
//  უნდა ააწყოთ წინადადება)



let allValue = [1, 'string', 1.5, true, {
    name: 'ილია',
    surname: 'კვიციანი',
    age: 14,
    country: 'საქარტველო',
    city: 'ისქარტველო'
}];
console.log(`ჩემი სახელია ${allValue[4].name} ჩემი გვარია ${allValue[4].surname}`);

console.log(`ჩემი ასაკია ${allValue[4].age} ჩემი ქვეყანაა ${allValue[4].country} ჩემი ქალაქია ${allValue[4].city}`);

 