// Object
// შექმენით ობიექტი car, რომელსაც ექნება მინიჭებული თვისებები, ეს თვისებები უნდა იყვეს - 1. brand    2. model    3. year 
//   4. color   5. weight   (თვისებებს მიანიჭეთ მნიშვნელობები თქვენით)

// შექმნილ ობიექტს დაამატეთ მეთოდი, რომელიც გამოიტანს წინადადებას ამ თვისებების დახმარებით - მაგ: 'ამ მანქანის ბრენდია
//  ...., კონკრეტული მოდელია ....' და ა.შ

// გამოიტანეთ car ობიექტიდან ყველა მნიშვნელობა ინდივიდუალურად.

// car ობიექტში შეცვლაეთ ყველა თვისების მნიშვნელობა.

// car ობიექტში დაამატეთ ახალი თვისება, რომელიც იქნება mode.

// car ობიექტში დამატებული თვისება ამოშალეთ.

// ობიექტთან გამოიყენეთ პირობითი განცხადებები და შეამოწმეთ ობიექტში მითითებული მანქანის ბრენდი თქვენც გყავთ თუ არა, 
// თუ გყავთ, მაშინ გამოიტანეთ - 'იგივე მანქანის ბრენდი გვყოლია ძმობილო', ხოლო სხვა შემთხვევაში გამოიტანეთ - '
//  სხვადასხვა მანქანის ბრენდია, ჩემი მოუგებს'




const car = {
    brand: "Toyota",
    model: "Corolla",
    year: 2020,
    color: "Red",
    weight: 1500
  };
  

  console.log(car.brand);
  console.log(car.model);
  console.log(car.year);
  console.log(car.color);
  console.log(car.weight);
  
  car.brand = "Honda";
  car.model = "Civic";
  car.year = 2021;
  car.color = "Blue";
  car.weight = 1400;
  car.mode = "Automatic";

  delete car.mode;
  
  const myCarBrand = "Toyota";
  if (car.brand === myCarBrand) {
    console.log("იგივე მანქანის ბრენდი გვყოლია ძმობილო");
  } else {
    console.log("სხვადასხვა მანქანის ბრენდია, ჩემი მოუგებს");
  }
  