// # Level 120:

// # 1. შექმენით car ობიექტი, რომელსაც მიანიჭებთ 3 თვისებას, ეს თვისებებია brand, model და color. თვისებებს აუცილებლად მიანიჭეთ მნიშვნელობები. თქვენი
//  დავალებაა გამოიტანოთ კონსოლში თვისებების დასახელება და შემდეგ თვისებების მნიშვნელობები.

// # თვისებების და მნიშვნელობების გამოტანის შემდეგ გამოიტანეთ გაერთიანებული ტექსი, სადაც ერთ ფრაზაში იქნება მოცემული ინფორმაცია. მაგ: ეს არის ... ბრენდი,
//  კონკრეტულად ... მოდელი.__

const car = {
    brand: 'Toyota',
    model: 'Corolla',
    color: 'Red'
};

 