// დავალება 3: სასტუმროს მართვა
// შექმენით hotel ობიექტი, რომელიც შეიცავს:

 
// hotelName
// stars (რეიტინგი 1-დან 5-მდე)
// location
// guestReviews (ჩაშენებული ობიექტი 3 სტუმრის შეფასებით)


// შემდეგ:

// გამოიტანეთ ობიექტის თვისებები და მათი მნიშვნელობები.

// შეამოწმეთ, გააჩნია თუ არა spa ველი.

// დაამატეთ roomsCount ახალი ობიექტის გაერთიანებით.

// გაყინეთ ობიექტი და სცადეთ მისი შეცვლა.

// შეამოწმეთ, გაყინულია თუ არა ობიექტი.













// დავალება 4: კინოს მონაცემთა ბაზა
// შექმენით cinema ობიექტი, რომელიც შეიცავს:

 
// cinemaName
// moviesCount
// location
// movieReviews (ჩაშენებული ობიექტი, სადაც იქნება 3 მომხმარებლის შეფასება)


// შემდეგ:

// გამოიტანეთ ობიექტის თვისებები და მათი მნიშვნელობები.

// შეამოწმეთ, გააჩნია თუ არა vipSeats ველი.

// დაამატეთ ticketPrice ახალი ობიექტის გაერთიანებით.

// გაყინეთ ობიექტი და სცადეთ მისი შეცვლა.

// შეამოწმეთ, გაყინულია თუ არა ობიექტი.














// დავალება 5: ისწავლეთ ქვემოთ მოცემული მეთოდები:
// is()
// preventExtensions()
// isExtensible()
// assign() - ისწავლეთ უფრო დეტალურად


