// 1)რიცხვის შემოწმება
// მომხმარებელი შეჰყავს ერთი რიცხვი და უნდა გამოიტანოს ინფორმაცია, არის ეს რიცხვი ლუწი თუ კენტი.

let number = (prompt("შეიყვანეთ რიცხვი:"));

if (number % 2 === 0) {
    console.log(`${number} არის ლუწი.`);
} else {
    console.log(`${number} არის კენტი.`);
}



// 2)ტემპერატურის სტანდარტის შემოწმება
// მომხმარებელი შეჰყავს ტემპერატურა ცელსიუსში და უნდა განსაზღვროს, თუ როგორი ტემპერატურაა, ცივი, ზომიერი თუ ცხელი.

let temperature = (prompt("შეიყვანეთ ტემპერატურა ცელსიუსში:"));


if (temperature < 0) {
    console.log("ტემპერატურა არის ცივი.");
} else if (temperature >= 0 && temperature <= 25) {
    console.log("ტემპერატურა არის ზომიერი.");
} else {
    console.log("ტემპერატურა არის ცხელი.");
}




//3) სკოლის შეფასების სისტემა
// მომხმარებელი შეჰყავს ქულა (0-100) და უნდა განსაზღვროს, რა შეფასება ეკუთვნის მას შემდეგი პირობის მიხედვით:

 
// 90-100: A
// 80-89: B
// 70-79: C
// 60-69: D
// 0 - 59: F



let score = (prompt("შეიყვანეთ ქულა (0-100):"));


if (score >= 90 && score <= 100) {
    console.log("შეფასება: A");
} else if (score >= 80 && score < 90) {
    console.log("შეფასება: B");
} else if (score >= 70 && score < 80) {
    console.log("შეფასება: C");
} else if (score >= 60 && score < 70) {
    console.log("შეფასება: D");
} else if (score >= 0 && score < 60) {
    console.log("შეფასება: F");
} else {
    console.log("შეიყვანეთ ვალიდური ქულა (0-100).");
}