let age = (prompt("შეიყვანეთ თქვენი ასაკი:"));


if (age > 80) {
    console.log("დაბერდი ძმაო");
    alert("დაბერდი ძმაო");
} else if (age > 18) {
    console.log("შენ ხარ სრულწოვანი");
    alert("შენ ხარ სრულწოვანი");
} else if (age > 12) {
    console.log("შენ ხარ თინეიჯერი რომელიც გაგისწორდება  მოზარდი");
    alert("შენ ხარ თინეიჯერი ან მიზარდი რომელიც გაგისწორდება მოზარდი");
} else if (age > 5) {
    console.log("შენ ხარ ბავშვი");
    alert("შენ ხარ ბავშვი");
} else {
    console.log("შენ ხარ ძალიან პატარა");
    alert("შენ ხარ ძალიან პატარა");
}