# """3) ახსენით რისთვის გვჭირდება Tuple და რისთვის გვჭირდება Set"""


# სია
list1 = [10, 20, 30, "apple", "banana"]
print(list1)

# ტუპლი
tuple1 = (1, 2, 3, "cat", "dog")
print(tuple1 [4])

# სეტი
set1 = {100, 200, 300, "apple", "banana"}
print(set1)




# შეგიძლიათ დაამატოთ და წაშალოთ ელემენტები. სეტში ვერ იქნებიან დუბლიკატები

# მაგალითად გვინდა ვქმნით სიას და არ გვინდა რომ შიგნით დუბლიკანტები დავწეროტ გვინდა რომ შიგნით იყოს თითო თითო ყველაფერი მაგ:


# set1 = {100, 200, 300, "apple", "banana" 200, 200, 200, } ?ამის აუთფუთი იქნება ერერი რადგან ჩვენ გუბლიკანტები გვაქვს
# print(set1)

# მეტი რავი ბევრ რამეშია გამოსადეგი ლისტთან მუშაობისას



# ტუპლი
tuple1 = (1, 2, 3, "cat", "dog")
print(tuple1 [4])



#  Tuple  Immutable ვერ შეცვლი, დაამატებ ან წაშლი ელემენტებს.
#  დუბლიკატების არსებობა  Tuple შეუძლია ჰქონდეს ერთსა და იმავე ელემენტი რამდენჯერმე.

# ტუპლი დამოსადეგია რადგან მასში შენახული მნიშვნელობა არ ვერ შეიცვლება



