'''17)შექმენით ფუნქცია რომელსაც გადაეცემა სია შემდგარი სტრინგებისგან
 ---> (["dato" , "nika" , "polieqtori" , "zaza"....)], დამატებით 
 შექმენით ორი სია odd = [] და even = [], გადაუარეთ ორიგინალ სიას 
 for ციკლით და გაიგეთ რომელი ელემენტი შედგება კენტი ასოებისგან და 
 რომელი ლუწი, საბოლოოდ ჩაამატეთ შესაბამისი სტრინგები შესაბამის სიებში 
 (odd / even) დიდ ასოებათ (upper) და ბოლოს დაბეჭდეთ. 
'''

def smallest_number(numbers_list):
    return min(numbers_list)
numbers = [3, 1, 4, 1, 5, 9]
print(smallest_number(numbers))  