// კომენტარის სახით ახსენით თუ რა არის strict mode(მკაცრი რეჟიმი).

// Strict mode (მკაცრი რეჟიმი) არის JavaScript-ის ფუნქცია, რომელიც ამკაცრებს კოდის წერის წესებს.
// ის ხელს უწყობს შეცდომების ადრეულ აღმოჩენას და თავიდან აცილებას, რაც კოდის უფრო უსაფრთხოს და სტაბილურს ხდის.
// Strict mode-ის ჩართვა შესაძლებელია "use strict"  გამოყენებით, გლობალურად ან ლოკალურად (ფუნქციის შიგნით).
// მაგალითად, strict mode არ აძლევს უფლებას ცვლადების დეკლარაციის გარეშე გამოყენებას, 
// ხელს უშლის ობიექტის თვისებების შეცვლას, თუ ისინი გაყინულია, და სხვა.
// ეს რეჟიმი განსაკუთრებით სასარგებლოა დიდი და კომპლექსური პროექტებისთვის.
//მოკლედ სტრიქტ მოუდი მაგარია



//2
//კომენტარის სახით ახსენით თუ რისთვის გამოიყენება strict mode.

// 1. თავიდან აიცილოთ ცვლადების დეკლარაციის გარეშე გამოყენება.
// 2. აიკრძალოს დუბლიკატური პარამეტრები ფუნქციის დეკლარაციაში.
// 3. თავიდან აიცილოთ ობიექტის თვისებების შეცვლა, თუ ისინი არაკონფიგურირებადია ან გაყინულია.
// 4. თავიდან აიცილოთ რეზერვირებული სიტყვების გამოყენება ცვლადების ან ფუნქციების სახელებად.
// ეს რეჟიმი განსაკუთრებით სასარგებლოა დიდი და კომპლექსური პროექტებისთვის, სადაც კოდის სტაბილურობა და უსაფრთხოება მნიშვნელოვანია.


//3

// კომენტარის სახით ახსენით თუ რამდენი ტიპის strict mode არსებობს და როგორ/რანაირად ყენდება იგი.
 
// Strict mode-ის ორი ტიპი არსებობს, რომლებიც დამოკიდებულია მის გამოყენების არეალზე:
// 1. გლობალური strict mode - გამოიყენება მთელ სკრიპტზე. ამისთვის საჭიროა "use strict"; 
//    განთავსდეს სკრიპტის დასაწყისში, სანამ სხვა კოდი დაიწერება.
 
//
// 2. ლოკალური strict mode - გამოიყენება კონკრეტულ ფუნქციაში. ამისთვის "use strict"; 
//    განთავსდება ფუნქციის შიგნით, რაც მხოლოდ ამ ფუნქციაზე იმოქმედებს.
//    მაგალითი:
 
//
// Strict mode-ის გამოყენება ხელს უწყობს კოდის უსაფრთხოებას და შეცდომების თავიდან აცილებას,
// რაც განსაკუთრებით მნიშვნელოვანია დიდი და კომპლექსური პროექტებისთვის.




//4
// გააკეთეთ 3 მაგალითი ცვლადებზე strict mode ის გამოყენებით.


"use strict";
try {
    undeclaredVar = 10; 
} catch (error) {
    console.log("Error:", error.message);
}


// გააკეთეთ 3 მაგალითი ფუნქციებზე strict mode ის გამოყენებით.

function My_function() {
    "use strict";
    try {
        undeclaredVariable = 42;
    } catch (error) {
        console.log("Error in Myfunction:", error.message);
    }
}
My_function();